; domain
(define (domain GridYx)
  (:requirements :strips)
  (:predicates (visited ?p)
           (at ?p)
           (canmoveup ?p1 ?p2)
           (canmovedown ?p1 ?p2)
           (canmoveleft ?p1 ?p2)
           (canmoveright ?p1 ?p2)
    )
  (:action moveup
         :parameters (?p1 ?p2)
         :precondition (and (not (visited ?p2)) (at ?p1) (canmoveup ?p1 ?p2))
         :effect (and (not (at ?p1)) (at ?p2) (visited ?p2))
    )
  (:action movedown
         :parameters (?p1 ?p2)
         :precondition (and (not (visited ?p2)) (at ?p1) (canmovedown ?p1 ?p2))
         :effect (and (not (at ?p1)) (at ?p2) (visited ?p2))
    )

  (:action moveleft
         :parameters (?p1 ?p2)
         :precondition (and (not (visited ?p2)) (at ?p1) (canmoveleft ?p1 ?p2))
         :effect (and (not (at ?p1)) (at ?p2) (visited ?p2))
    )

  (:action moveright
         :parameters (?p1 ?p2)
         :precondition (and (not (visited ?p2)) (at ?p1) (canmoveright ?p1 ?p2))
         :effect (and (not (at ?p1)) (at ?p2) (visited ?p2))
    )
)

; problem
(define (problem Grid10x)
(:domain GridYx)
(:objects pos-0-0 pos-1-0 pos-0-1 pos-1-1 pos-0-2 pos-1-2 pos-0-3 pos-1-3 pos-0-4 pos-1-4 pos-0-5 pos-1-5 pos-0-6 pos-1-6 pos-0-7 pos-1-7 pos-0-8 pos-1-8 pos-0-9 pos-1-9)
(:init (canmoveright pos-0-0 pos-0-1)
(canmovedown pos-0-0 pos-1-0)
(canmoveright pos-1-0 pos-1-1)
(canmoveup pos-1-0 pos-0-0)
(canmoveleft pos-0-1 pos-0-0)
(canmoveright pos-0-1 pos-0-2)
(canmovedown pos-0-1 pos-1-1)
(canmoveleft pos-1-1 pos-1-0)
(canmoveright pos-1-1 pos-1-2)
(canmoveup pos-1-1 pos-0-1)
(canmoveleft pos-0-2 pos-0-1)
(canmoveright pos-0-2 pos-0-3)
(canmovedown pos-0-2 pos-1-2)
(canmoveleft pos-1-2 pos-1-1)
(canmoveright pos-1-2 pos-1-3)
(canmoveup pos-1-2 pos-0-2)
(canmoveleft pos-0-3 pos-0-2)
(canmoveright pos-0-3 pos-0-4)
(canmovedown pos-0-3 pos-1-3)
(canmoveleft pos-1-3 pos-1-2)
(canmoveright pos-1-3 pos-1-4)
(canmoveup pos-1-3 pos-0-3)
(canmoveleft pos-0-4 pos-0-3)
(canmoveright pos-0-4 pos-0-5)
(canmovedown pos-0-4 pos-1-4)
(canmoveleft pos-1-4 pos-1-3)
(canmoveright pos-1-4 pos-1-5)
(canmoveup pos-1-4 pos-0-4)
(canmoveleft pos-0-5 pos-0-4)
(canmoveright pos-0-5 pos-0-6)
(canmovedown pos-0-5 pos-1-5)
(canmoveleft pos-1-5 pos-1-4)
(canmoveright pos-1-5 pos-1-6)
(canmoveup pos-1-5 pos-0-5)
(canmoveleft pos-0-6 pos-0-5)
(canmoveright pos-0-6 pos-0-7)
(canmovedown pos-0-6 pos-1-6)
(canmoveleft pos-1-6 pos-1-5)
(canmoveright pos-1-6 pos-1-7)
(canmoveup pos-1-6 pos-0-6)
(canmoveleft pos-0-7 pos-0-6)
(canmoveright pos-0-7 pos-0-8)
(canmovedown pos-0-7 pos-1-7)
(canmoveleft pos-1-7 pos-1-6)
(canmoveright pos-1-7 pos-1-8)
(canmoveup pos-1-7 pos-0-7)
(canmoveleft pos-0-8 pos-0-7)
(canmoveright pos-0-8 pos-0-9)
(canmovedown pos-0-8 pos-1-8)
(canmoveleft pos-1-8 pos-1-7)
(canmoveright pos-1-8 pos-1-9)
(canmoveup pos-1-8 pos-0-8)
(canmoveleft pos-0-9 pos-0-8)
(canmovedown pos-0-9 pos-1-9)
(canmoveleft pos-1-9 pos-1-8)
(canmoveup pos-1-9 pos-0-9)
(at pos-0-0)
(visited pos-0-0))
(:goal (and (visited pos-0-0) (visited pos-1-0) (visited pos-0-1) (visited pos-1-1) (visited pos-0-2) (visited pos-1-2) (visited pos-0-3) (visited pos-1-3) (visited pos-0-4) (visited pos-1-4) (visited pos-0-5) (visited pos-1-5) (visited pos-0-6) (visited pos-1-6) (visited pos-0-7) (visited pos-1-7) (visited pos-0-8) (visited pos-1-8) (visited pos-0-9) (visited pos-1-9)))
)

; plan
1. (moveright pos-0-0 pos-0-1)
   deleted: (at pos-0-0)
   added: (at pos-0-1) (visited pos-0-1)
   goals met: 2 of 20
2. (moveright pos-0-1 pos-0-2)
   deleted: (at pos-0-1)
   added: (at pos-0-2) (visited pos-0-2)
   goals met: 3 of 20
3. (moveright pos-0-2 pos-0-3)
   deleted: (at pos-0-2)
   added: (at pos-0-3) (visited pos-0-3)
   goals met: 4 of 20
4. (moveright pos-0-3 pos-0-4)
   deleted: (at pos-0-3)
   added: (at pos-0-4) (visited pos-0-4)
   goals met: 5 of 20
5. (moveright pos-0-4 pos-0-5)
   deleted: (at pos-0-4)
   added: (at pos-0-5) (visited pos-0-5)
   goals met: 6 of 20
6. (moveright pos-0-5 pos-0-6)
   deleted: (at pos-0-5)
   added: (at pos-0-6) (visited pos-0-6)
   goals met: 7 of 20
7. (moveright pos-0-6 pos-0-7)
   deleted: (at pos-0-6)
   added: (at pos-0-7) (visited pos-0-7)
   goals met: 8 of 20
8. (moveright pos-0-7 pos-0-8)
   deleted: (at pos-0-7)
   added: (at pos-0-8) (visited pos-0-8)
   goals met: 9 of 20
9. (moveright pos-0-8 pos-0-9)
   deleted: (at pos-0-8)
   added: (at pos-0-9) (visited pos-0-9)
   goals met: 10 of 20
10. (movedown pos-0-9 pos-1-9)
   deleted: (at pos-0-9)
   added: (at pos-1-9) (visited pos-1-9)
   goals met: 11 of 20
11. (moveleft pos-1-9 pos-1-8)
   deleted: (at pos-1-9)
   added: (at pos-1-8) (visited pos-1-8)
   goals met: 12 of 20
12. (moveleft pos-1-8 pos-1-7)
   deleted: (at pos-1-8)
   added: (at pos-1-7) (visited pos-1-7)
   goals met: 13 of 20
13. (moveleft pos-1-7 pos-1-6)
   deleted: (at pos-1-7)
   added: (at pos-1-6) (visited pos-1-6)
   goals met: 14 of 20
14. (moveleft pos-1-6 pos-1-5)
   deleted: (at pos-1-6)
   added: (at pos-1-5) (visited pos-1-5)
   goals met: 15 of 20
15. (moveleft pos-1-5 pos-1-4)
   deleted: (at pos-1-5)
   added: (at pos-1-4) (visited pos-1-4)
   goals met: 16 of 20
16. (moveleft pos-1-4 pos-1-3)
   deleted: (at pos-1-4)
   added: (at pos-1-3) (visited pos-1-3)
   goals met: 17 of 20
17. (moveleft pos-1-3 pos-1-2)
   deleted: (at pos-1-3)
   added: (at pos-1-2) (visited pos-1-2)
   goals met: 18 of 20
18. (moveleft pos-1-2 pos-1-1)
   deleted: (at pos-1-2)
   added: (at pos-1-1) (visited pos-1-1)
   goals met: 19 of 20
19. (moveleft pos-1-1 pos-1-0)
   deleted: (at pos-1-1)
   added: (at pos-1-0) (visited pos-1-0)
   goals met: 20 of 20
